---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ModelGraphicsStyle
source: html/66070eba-280e-acfd-bb99-72eb5cddeb25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ModelGraphicsStyle Property

"Visual Style"

## Syntax (C#)
```csharp
public static ForgeTypeId ModelGraphicsStyle { get; }
```